# how to create python pandas dataframe

In [1]:
import pandas as pd

In [2]:
empdf=pd.DataFrame()
print(empdf)

Empty DataFrame
Columns: []
Index: []

In [3]:
list=[1,2,3,4,5]

In [4]:
df1=pd.DataFrame(list)
print(df1)

   0
0  1
1  2
2  3
3  4
4  5

In [5]:
dataf=pd.DataFrame([1,2,3,4,5,6,7,8,9,0])
dataf

   0
0  1
1  2
2  3
3  4
4  5
5  6
6  7
7  8
8  9
9  0

In [8]:
dd1=pd.DataFrame([1,2,3,44,5,88888,9,4])
dd1

       0
0      1
1      2
2      3
3     44
4      5
5  88888
6      9
7      4

In [ ]:
#index ke baju me jo 0 hai vo data value ka label hai

In [9]:
#only df1 ka use karke bhi variable ko print kar sakte hai
df1

   0
0  1
1  2
2  3
3  4
4  5

In [11]:
lsofls=[[1,2,3],[4,5,6],[7,8,9],[10,11,12]]
lsofls

[[1, 2, 3], [4, 5, 6], [7, 8, 9], [10, 11, 12]]

In [12]:
#more than 1 colum for dataframe
df2=pd.DataFrame(lsofls)
df2

    0   1   2
0   1   2   3
1   4   5   6
2   7   8   9
3  10  11  12

In [ ]:
#first me index hota hai isliye lable nhi aata hai

In [14]:
#dict me list ka use karke data frame create karna
dict1={'id.number':[11,12,13,14,15]}
dict1

{'id.number': [11, 12, 13, 14, 15]}

In [15]:
dictt={'id.number':[11,12,13,14,15],'id name':['ram','nayan','gita','mita','sita']}
dictt
dff=pd.DataFrame(dictt)
dff

   id.number id name
0         11     ram
1         12   nayan
2         13    gita
3         14    mita
4         15    sita

In [ ]:
dff2=pd.DataFrame

In [ ]:
df3=pd.DataFrame(dict1)
df3

In [20]:
dict_1={"rahul":[1,2,4,5,6],'gagan':[1,5,6,8,9]}
dddd=pd.DataFrame(dict_1)
dddd

   rahul  gagan
0      1      1
1      2      5
2      4      6
3      5      8
4      6      9

In [16]:
dict2={'id.number':[11,12,13,14,15],'add':['sadar','ganj','kothi','market','badore']}
df4=pd.DataFrame(dict2)
df4

   id.number     add
0         11   sadar
1         12    ganj
2         13   kothi
3         14  market
4         15  badore

In [21]:
dff=pd.DataFrame({'id.number':[11,12,13,14,15],'add':['sadar','ganj','kothi','market','badore']})
dff

   id.number     add
0         11   sadar
1         12    ganj
2         13   kothi
3         14  market
4         15  badore

In [ ]:
#list me dictionary ki help se dataframe create karna

In [23]:
lsdict=[{'a':1,'b':2},{'a':1,'b':2},{'a':3,'b':4}]
lsdict

[{'a': 1, 'b': 2}, {'a': 1, 'b': 2}, {'a': 3, 'b': 4}]

In [24]:
df5=pd.DataFrame(lsdict)
df5

   a  b
0  1  2
1  1  2
2  3  4

In [25]:
lsdict1=[{'a':1,'b':2},{'a':1,'b':2},{'a':3,'b':4,'c':5},]
df6=pd.DataFrame(lsdict1)
df6

   a  b    c
0  1  2  NaN
1  1  2  NaN
2  3  4  5.0

In [ ]:
#nan=not a numper non ye panda ka functin hota hai jo missing value ko handle karta hai

In [26]:
#next function dict me series se data frame create karna
dictser={'id':pd.Series([1,2,3,4]),'SN':[111,222,333,444]}
df7=pd.DataFrame(dictser)
df7

   id   SN
0   1  111
1   2  222
2   3  333
3   4  444